{
  "navigation": {
    "home": "Басты",
    "about": "Мен туралы",
    "experience": "Тәжірибе",
    "travelshop": "TravelShop",
    "features": "Шешімдер",
    "workplace": "Жұмыс орны",
    "contacts": "Байланыс"
  },
  "splash": {
    "welcome": "Данил Лисин",
    "subtitle": "Vue.js әзірлеушісі",
    "description": "Күрделі мәселелерді талғампаз шешімдерге айналдырамын. Vue 3, TypeScript және ойластырылған архитектурасы бар масштабталатын қолданбалар жасауға мамандандым.",
    "more": "резюмені қарау"
  },
  "app": {
    "examples_title": "Кейбір шешімдердің мысалдары"
  },
  "about": {
    "intro": "Фронтенд-әзірлеуші (Vue.js) • Vue-де 6+ жыл коммерциялық тәжірибе • Веб-әзірлеу және дизайнда 20+ жыл",
    "approach": "Мен Vue.js 3 көмегімен күрделі, жылдам және ыңғайлы SPA қолданбалар жасаймын. Фронтенд-архитектураны терең түсіну мен дизайн және UX-ке деген талғамдылығымды үйлестіре отырып, мен тек қана тиімді емес, сонымен қатар пайдаланушыларға ұнайтын интерфейстерді жобалай аламын.",
    "bitrix_title": "Bitrix тәжірибесі",
    "bitrix_description": "Әр түрлі әуекомпаниялар үшін TravelShop 1.0 жаңа үлгілерін қолдау мен әзірлеумен айналыстым. Ол үшін PHP тілін жақсы білемін. Bitrix ерекшеліктерін түсінемін.",
    "bitrix_skills": [
      "TravelShop 1.0 үлгілерін әзірлеу және қолдау",
      "Авиабилеттерді брондау жүйелерімен интеграция",
      "Әуекомпания талаптарына байланысты функционалды теңшеу",
      "Bitrix-жобалар контекстінде PHP-пен жұмыс",
      "Bitrix архитектурасы мен ерекшеліктерін түсіну"
    ],
    "skills_title": "Жұмыста архитектуралық тазалыққа, кодтың қолдауға бейімділігіне және тип қауіпсіздігіне назар аударамын. Күрделі SPA-ның фронтенд бөліктерін толық циклде әзірлеу тәжірибесі бар:",
    "skills_list": [
      {
        "title": "Қолданба құрылымын жобалау",
        "description": "Модульдік және масштабталатын архитектураны әзірлеу, код базасын қолдау мен даму ыңғайлылығы үшін ұйымдастыру"
      },
      {
        "title": "Интерфейстерді версткалау",
        "description": "Заманауи тәсілдерді (Flexbox, Grid) қолдана отырып, бейімді, кроссбраузерлік және қолжетімді интерфейстерді жасау"
      },
      {
        "title": "Жай-күйді басқаруды жүзеге асыру",
        "description": "Орталықтандырылған қойманы (Pinia/Vuex) конфигурациялау, деректерді және олардың компоненттер арасындағы реактивті байланыстарын ұйымдастыру"
      },
      {
        "title": "Клиент-серверлік өзара әрекеттесу",
        "description": "API-мен жұмыс істеу үшін сервис-қабатын құру, қателерді өңдеу, қайта сұрау және кэштеу механизмдерін жүзеге асыру"
      },
      {
        "title": "Маршруттау",
        "description": "Ішкі және қорғалған маршруттары, компоненттердің кеш жүктелуі бар күрделі навигация жүйелерін әзірлеу"
      }
    ],
    "conclusion": "Мұндай көзқарас сенімді және масштабталатын шешімдерді жасауға мүмкіндік береді, оларды дамыту және қолдау ыңғайлы.",
    "tech_title": "Технологиялар мен құралдар",
    "tech_stack_title": "Технологиялық стек",
    "main_tech_title": "Негізгі технологиялар",
    "main_tech_list": [
      {
        "title": "Vue.js 3",
        "description": "Composition API, composables, реактивтілік, lifecycle hooks-пен жұмыс істеуді қолдана отырып, SPA-қолданбаларды әзірлеу..."
      },
      {
        "title": "TypeScript",
        "description": "Қатаң типтеу, generics, utility types, компоненттер мен қоймалардағы тип қауіпсіздігі"
      },
      {
        "title": "Pinia",
        "description": "Composition API қолдана отырып, қолданба жай-күйін басқару, Setup Store синтаксисі арқылы модульдік қоймаларды ұйымдастыру, TypeScript интеграциясы"
      },
      {
        "title": "Vite",
        "description": "Жобаларды жылдам жинау, плагиндерді конфигурациялау, production жинағын оңтайландыру"
      }
    ],
    "infra_tech_title": "Инфрақұрылым және құралдар",
    "infra_tech_list": [
      {
        "title": "Vue Router",
        "description": "Lazy loading, nested routes, навигациялық хуқтар, өту тарихы бар навигация"
      },
      {
        "title": "Vue i18n",
        "description": "Қолданбаларды локализациялау, аудармаларды динамикалық жүктеу, pluralization"
      },
      {
        "title": "Git",
        "description": "Командалық жұмыс, feature branches, code review, қайшылықтарды шешу"
      },
      {
        "title": "REST API",
        "description": "HTTP-сұраулар үшін арнайы орамаларды әзірлеу және пайдалану, қателерді өңдеу, кэштеу, сұраулар өмірлік циклін басқару"
      }
    ],
    "layout_tech_title": "Верстка және стильдеу",
    "layout_tech_list": [
      {
        "title": "HTML5/CSS3",
        "description": "Семантикалық верстка, бейімді дизайн, CSS Grid/Flexbox"
      },
      {
        "title": "SCSS/SASS",
        "description": "Препроцессинг, миксиндер, стильдердің модульділігі, арнайы CSS қасиеттері (CSS Custom Properties)"
      }
    ]
  },
  "tech": {
    "javascript": "Барлығының негізі. Заманауи ES6+ код жазамын",
    "vue": "Менің негізгі мамандануым. Vue 3, Composition API",
    "typescript": "Код сенімділігі үшін қатаң типтеу",
    "pinia": "Қолданба жай-күйін басқару",
    "vite": "Жылдам әзірлеу үшін заманауи жинақ",
    "i18n": "Локализация және көптілді интерфейстер",
    "html": "Семантикалық және қолжетімді верстка",
    "css": "Бейімді дизайн, Flexbox, Grid",
    "php": "Bitrix экожүйесінде PHP-үлгілерін әзірлеу",
    "bitrix": "Әуекомпаниялар үшін TravelShop үлгілерін қолдау",
    "git": "Барлық жобалар үшін таратылған нұсқаларды басқару",
    "svn": "Орталықтандырылған нұсқаларды басқару жүйелерімен жұмыс тәжірибесі",
    "figma": "Figma үлгілерімен жұмыс, верстка және түзетулер"
  },
  "experience": {
    "title": "Жұмыс тәжірибесі",
    "showAllButton": "Барлық компаниялар",
    "items": [
      {
        "company": "Online Reservation System",
        "duration": "4 жыл 11 ай",
        "position": "Жетекші HTML верстальщик / Фронтенд-әзірлеуші",
        "period": "Желтоқсан 2020 — Қазан 2025",
        "description": "TWx, TravelShop өнімдері үшін Vue 3 компоненттерін жобалау және әзірлеу. Пайдаланушы интерфейстерінің архитектурасын жасау, авиабилеттерді брондау жүйесі үшін интерактивті элементтер мен күрделі SPA-қолданбаларды әзірлеу. Әр түрлі әуекомпаниялар үшін Bitrix басқаруындағы TravelShop үлгілерін қолдау және теңшеу."
      },
      {
        "company": "Таис",
        "duration": "3 жыл 3 ай",
        "position": "Web-әзірлеуші",
        "period": "Қазан 2017 — Желтоқсан 2020",
        "description": "Онлайн-брондау және әуерейстерді тіркеу жүйелері үшін front-end интерфейстерін әзірлеу. Интуитивті пайдаланушы интерфейстерін жасау, формалармен және деректерді тексерумен жұмыс, бэкенд-жүйелері мен API-мен интеграция."
      },
      {
        "company": "ТНТ, Телекомпания",
        "position": "Веб-дизайнер",
        "description": "Теледидар жобалары үшін анимациялық және интерактивті жарнамалық баннерлерді жасау. Толық әзірлеу циклі: концепция мен дизайнан бастап HTML5, CSS3 және JavaScript қолдана отырып іске асыруға дейін. Әр түрлі өлшемдер мен құрылғыларды қолдайтын бейімді баннерлерді жасау."
      },
      {
        "company": "Баусервис, ООО",
        "position": "Веб-дизайнер",
        "description": "Корпоративті сайттардың дизайнын әзірлеу, жарнамалық баннерлер мен иконографияны жасау. Интерфейстерді жобалаудың толық циклі: прототиптеу және визуалды дизайнан бастап бейімді версткаға дейін. Графиканы оңтайландыру және кроссбраузерлік үйлесімділікті қамтамасыз ету."
      },
      {
        "company": "Европейская медиагруппа (ЕМГ)",
        "position": "Веб-дизайнер / Веб-әзірлеуші",
        "description": "Компанияның медиа жобалары үшін веб-сайттарды әзірлеу және қолдау. Пайдаланушы интерфейстерін жасау, промо-беттер мен лендингтерді дизайндау. Дизайнды контентті басқару жүйелерімен интеграциялау, веб-беттердің өнімділігін оңтайландыру."
      },
      {
        "company": "Advego",
        "position": "Веб-дизайнер / Веб-әзірлеуші",
        "description": "Веб-жобаларды жасаудың толық циклі: пайдаланушы интерфейстерін жобалау және дизайнан бастап frontend-әзірлеуге дейін. Контент биржасы үшін интуитивті интерфейстерді жасау, әкімшілік панельдер мен пайдаланушы кабинеттерін әзірлеу. Пайдаланушы тәжірибесі мен өзара әрекеттесуді оңтайландыру."
      },
      {
        "company": "NIKITA ONLINE",
        "position": "Веб-дизайнер",
        "description": "Компанияның ойын жобалары үшін корпоративті сайттар мен промо-беттердің дизайнын әзірлеу. Визуалды концепцияларды жасау, бет үлгілері мен интерфейс элементтерін әзірлеу. Веб-жарияланымдар үшін графикалық материалдарды дайындау."
      },
      {
        "company": "Nettrader",
        "position": "Веб-дизайнер",
        "description": "Қаржылық және сауда платформалары үшін пайдаланушы интерфейстерінің дизайны. Қаржылық деректермен жұмыс істеу үшін интуитивті және функционалды интерфейстерді жасау. Визуалды коммуникация жүйесі мен брендтік элементтерді әзірлеу."
      },
      {
        "company": "Коммуникационное агентство SOLDIS",
        "position": "Веб-дизайнер",
        "description": "Агентство тұтынушылары үшін сайттардың дизайнын жасау. Визуалды концепцияларды әзірлеу, үлгілер мен графикалық элементтерді дайындау. Веб-ресурстардағы пайдаланушы тәжірибесі мен навигацияны жақсарту бойынша жұмыс."
      },
      {
        "company": "Ютинет.Ру",
        "position": "Веб-дизайнер",
        "description": "Интернет-портал үшін веб-интерфейстерді дизайндау және әзірлеу. Пайдаланушы интерфейстерін жасау, навигация мен контент құрылымын жақсарту бойынша жұмыс. Графикалық элементтер мен визуалды сәйкестендіру жүйесін әзірлеу."
      },
      {
        "company": "Цифровой центр ИОН",
        "position": "Веб-дизайнер",
        "description": "Әр түрлі бизнес-сегменттер үшін веб-сайттарды жобалау және дизайндау. Интерфейстерді жасаудың толық циклі: мақсатты аудиторияны зерттеу және прототиптерді жасаудан бастап түпкілікті іске асыруға дейін. Бейімді дизайндарды әзірлеу және кроссбраузерлік үйлесімділікті қамтамасыз ету."
      },
      {
        "company": "ADT Web Solutions",
        "position": "Веб-дизайнер",
        "description": "Корпоративті сайттар мен интернет-дүкендердің дизайнын жасау. Пайдаланушы интерфейстерін әзірлеу, навигация мен контент құрылымын жобалау. Веб-жобалар үшін брендтік жұмыс және біртұтас визуалды жүйені құру."
      },
      {
        "company": "Фриланс",
        "position": "Веб-дизайнер",
        "description": "Әр түрлі тұтынушылар үшін веб-сайттарды дизайндау және әзірлеу бойынша тапсырыстарды орындау. Бірегей дизайн-концепцияларды жасау, бет үлгілерін әзірлеу, графикалық элементтерді дайындау. Идеядан іске асыруға дейін веб-жобаларды жасаудың толық циклі бойынша жұмыс."
      },
      {
        "company": "Артез продакшен",
        "position": "WEB дизайнер",
        "description": "Өндірістік компания тұтынушылары үшін веб-сайттарды дизайндау. Визуалды концепцияларды жасау, интерфейстер мен навигациялық жүйелерді әзірлеу. Веб-жарияланымдар үшін графиканы дайындау және дизайнның техникалық талаптарға сәйкестігін қамтамасыз ету."
      },
      {
        "company": "Publicis United",
        "position": "WEB дизайнер",
        "description": "Жарнамалық агентство ірі тұтынушылары үшін веб-сайттарды дизайндау және әзірлеу. Интерактивті интерфейстерді жасау, пайдаланушы тәжірибесін жақсарту бойынша жұмыс. Брендтер үшін кешенді цифрлық шешімдерді құруға қатысу. Корпоративтік стандарттар мен тұтынушы нұсқаулықтарына сәйкес жұмыс."
      },
      {
        "company": "AVM New Wave Inc.",
        "position": "WEB дизайнер",
        "description": "Ресейде интернеттің дамуының басында алғашқы веб-сайттарды дизайндау. Веб-дизайн мен навигацияның негізгі принциптерін құру. Сол кездегі шектеулі техникалық мүмкіндіктермен жұмыс, баяу интернет-байланыстар үшін графиканы оңтайландыру."
      }
    ]
  },
  "travelshop": {
    "title": "TravelShop 2.0 - Авиабилеттерді брондау жүйесі",
    "role": "Жетекші Frontend-әзірлеуші",
    "period": "Желтоқсан 2020 — Қазан 2025",
    "description": "Ресейлік және шетелдік әуекомпаниялар, соның ішінде «Азимут» үшін заманауи авиабилеттерді брондау жүйесін әзірлеу және қолдау",
    "features": {
      "title": "Жүйенің негізгі функциялары",
      "items": [
        "Авиабилеттерді нақты уақытта іздеу және брондау",
        "Тарифтер мен төлемдерді есептеудің күрделі бизнес-логикасы",
        "Деректерді тексеруі бар көпқадамды брондау процесі",
        "Тапсырыстар мен жолаушыларды басқару жүйесі",
        "Брондау жүйелерімен интеграция (GDS)",
        "Қосымша қызметтерді қолдау (жүк, тамақтану, сақтандыру)",
        "Барлық құрылғылар үшін бейімді дизайн"
      ]
    },
    "tech_stack": {
      "title": "Техникалық стек",
      "items": [
        "Composition API және TypeScript қосылған Vue 3",
        "Арнайы UI компоненттер кітапханасы",
        "Жылдам жинақ және әзірлеу үшін Vite",
        "Қолданба жай-күйін басқару үшін Pinia",
        "Компоненттерді кеш жүктеуі бар Vue Router",
        "Орталықтандырылған қате өңдеуі бар REST API",
        "Интернационализация (i18n)"
      ]
    },
    "achievements": {
      "title": "Жетістіктер мен нәтижелер",
      "items": {
        "scalable_architecture": "Масштабтауға болатын архитектура әзірленді, бұл жаңа функцияларды енгізуді 40% жеделдетті",
        "error_reduction": "Жолаушы деректерін тексеру жүйесін енгізу арқылы брондау қателері 60% қысқарды",
        "performance_improvement": "Іздеу сұранымдарын кэштейтін механизмді енгізу арқылы өнімділік 25% жақсарды",
        "code_reliability": "Кодты қарау процесін орнату және статикалық типтеуді енгізу арқылы код сенімділігі жақсарды",
        "responsive_design": "Әзірленген бейімделген дизайн арқылы барлық құрылғыларда дұрыс көрініс қамтамасыз етілді"
      }
    },
    "projects": {
      "title": "Іске асырылған жобалар",
      "items": [
        {
          "name": "«Азимут» әуекомпаниясы",
          "url": "https://booking.azimuth.ru/new/",
          "description": "Теңшеу дизайны бар толық функционалды брондау жүйесі"
        },
        {
          "name": "TravelShop White Label",
          "url": "https://ors-aero.ru/travelshop",
          "description": "Брондау жүйелерін жылдам орнату үшін негізгі платформа"
        }
      ]
    },
    "view_screenshots": "TravelShop скриншоттарын қарау",
    "loading_screenshots": "Скриншоттар жүктелуде...",
    "images": {
      "description": {
        "desktop_1": "Рейстерді іздеу формасы",
        "desktop_2": "Табылған рейстер экраны",
        "desktop_3": "Тарифті таңдау",
        "desktop_4": "Жолаушылар деректері формасы бар экран",
        "desktop_5": "Рейс бойынша қызметтерді таңдау",
        "desktop_6": "Ұшақ салонындағы орынды таңдау",
        "desktop_7": "Прекомит экраны",
        "desktop_8": "Таңдалған қызметтері бар себет",
        "default": "{number} суреті"
      }
    }
  },
  "common": {
    "loading": "Жүктелуде...",
    "loading_images": "Суреттер жүктелуде...",
    "loading_please_wait": "Күте тұрыңыз...",
    "previous_image": "Алдыңғы сурет",
    "next_image": "Келесі сурет",
    "close": "Жабу",
    "thumbnail": "{number} миниатюрасы"
  },
  "pipeline": {
    "title": "REST API сұраулардың конвейерлік жүйесі",
    "subtitle": "Өзара байланысты API-шақырулар тізбегін тиімді басқару",
    "description": "REST API-ге реттік HTTP-сұрауларды ұйымдастыру үшін күшті жүйе, мұнда әрбір келесі шақыру алдыңғының деректерін пайдалана алады. Прогресті визуализациялау және ақылды қате өңдеуі бар сұраулар тізбегінің орындалуын толық бақылауды қамтамасыз етеді.",
    "features": {
      "title": "Жүйенің негізгі мүмкіндіктері",
      "items": [
        "Өзара байланысты HTTP-сұраулар тізбегін реттік орындау",
        "Конвейер кезеңдері арасында деректерді автоматты беру",
        "Нақты уақыт режимінде орындалу прогрессін егжей-тегжейлі бақылау",
        "Қайталау механизмі бар HTTP-қателерін ақылды өңдеу",
        "Алдыңғы нәтижелерге негізделген сұрауларды шартты орындау логикасы",
        "Сыртқы қателер кезінде тәуелді сұрауларды автоматты тоқтату",
        "Орындалудың барлық кезеңдерінде толық тип қауіпсіздігі"
      ]
    },
    "architecture": {
      "title": "Архитектуралық компоненттер",
      "items": [
        {
          "name": "Pipeline Orchestrator",
          "description": "API-сұраулар тізбегінің орындалуын және олар арасындағы деректер беруді басқаратын орталық координатор"
        },
        {
          "name": "Request Executor",
          "description": "retry-логикасы, таймауттар және әр түрлі статус-кодтарды өңдеуді қолдайтын HTTP-сұраулар орындаушысы"
        },
        {
          "name": "Progress Tracker",
          "description": "Әрбір кезең бойынша егжей-тегжейленген сұраулар тізбегінің орындалу прогрессін бақылау модулі"
        },
        {
          "name": "Error Handler",
          "description": "Түрлер бойынша жіктеуі және қалпына келтіру стратегиялары бар орталықтандырылған қате өңдеуші"
        },
        {
          "name": "Type Safety Layer",
          "description": "Конвейердің барлық кезеңдерінде деректер дұрыстығын қамтамасыз ететін қатаң типтеу қабаты"
        }
      ]
    },
    "process": {
      "title": "Конвейер жұмыс процесі",
      "steps": [
        {
          "title": "Сұраулар тізбегін конфигурациялау",
          "description": "API-шақырулар тізбегін, олардың арасындағы тәуелділіктерді және әрбір кезеңнің орындалу шарттарын анықтау"
        },
        {
          "title": "Іске қосу және тексеру",
          "description": "Конфигурацияның дұрыстығын тексеру, деректерді дайындау және орындалу прогрессін бақылауды іске қосу"
        },
        {
          "title": "Реттік орындау",
          "description": "Деректерді автоматты беру және аралық нәтижелерді өңдеуі бар HTTP-сұрауларды кезең-кезеңмен орындау"
        },
        {
          "title": "Мониторинг және басқару",
          "description": "Прогресті үздіксіз бақылау, туындаған қателерді өңдеу және тізбек орындалуын бейімді басқару"
        },
        {
          "title": "Түпкілікті өңдеу және тазарту",
          "description": "Барлық сұраулар нәтижелерін жинақтау, деректерді финализациялау және жүйе ресурстарын босату"
        }
      ]
    },
    "benefits": {
      "title": "Көзқарастың артықшылықтары",
      "items": [
        "Күрделі API-өзара әрекеттесуді әзірлеу уақытын 40% қысқарту",
        "Орталықтандырылған қате өңдеу және retry-механизмдері арқылы сенімділікті арттыру",
        "Орындалу прогрессін дәл көрсету арқылы пайдаланушы тәжірибесін жақсарту",
        "Сұраулар тізбегін жөндеу және мониторингті жеңілдету",
        "Тәуелді API-шақырулары бар күрделі бизнес-процестерді жүзеге асыру үшін икемділік",
        "Толық тип қауіпсіздігі runtime-қателер санын азайтады",
        "Қолданыстағы Vue.js қолданба экожүйесімен жеңіл интеграция"
      ]
    }
  },
  "localization": {
    "title": "Репликаларды қайта анықтауы бар икемді локализация жүйесі",
    "subtitle": "Әр түрлі баңылдар үшін аудармаларды теңшеу механизмі",
    "description": "Іске асырылған жүйе жобаны жинау баңылына байланысты локалдерде нақты репликаларды қайта анықтауға мүмкіндік береді, бұл әр түрлі тұтынушылар үшін интерфейстерді теңшеуде икемділік қамтамасыз етеді.",
    "features": {
      "title": "Негізгі мүмкіндіктер",
      "items": [
        "Бүкіл сөздікті көшірмей-ақ нақты репликаларды қайта анықтау",
        "Әрқайсысы үшін теңшеуі бар көптеген тілдерді қолдау",
        "Әдепкі және теңшеу локалдерін автоматты біріктіру",
        "Әр түрлі жинақ баңылдарына икемді баптау",
        "Қайта анықталмаған репликалар үшін әдепкі мәндерді сақтау",
        "Жаңа теңшеу аудармаларын тез қосу"
      ]
    },
    "architecture": {
      "title": "Архитектуралық компоненттер",
      "items": [
        {
          "name": "Base Locales",
          "description": "барлық тілдер үшін стандартты репликалары бар негізгі аудармалар сөздіктері"
        },
        {
          "name": "Custom Locales",
          "description": "Нақты баңылдар үшін қайта анықталған репликалары бар теңшеу сөздіктері"
        },
        {
          "name": "Merge Engine",
          "description": "Жинақ кезінде әдепкі және теңшеу локалдерін біріктіру механизмі"
        },
        {
          "name": "Bundle Config",
          "description": "Қайта анықтау үшін теңшеу сөздіктерін көрсететін баңылдар конфигурациясы"
        }
      ]
    },
    "process": {
      "title": "Жұмыс процесі",
      "steps": [
        {
          "title": "Баңылды анықтау",
          "description": "Жүйе ағымдағы жинақ баңылын анықтайды және ол үшін теңшеу сөздіктерінің болуын тексереді"
        },
        {
          "title": "Локалдерді жүктеу",
          "description": "Негізгі аударма сөздіктері және көрсетілген баңыл үшін теңшеу сөздіктері жүктеледі"
        },
        {
          "title": "Сөздіктерді біріктіру",
          "description": "Әдепкі локалдер теңшеу локалдерімен біріктіріледі, ал теңшеу репликалары басым болады"
        },
        {
          "title": "Нәтижені генерациялау",
          "description": "Қолданбада қолданылатын түпкілікті аударма сөздіктері қалыптасады"
        }
      ]
    },
    "benefits": {
      "title": "Көзқарастың артықшылықтары",
      "items": [
        "Әр түрлі тұтынушылар үшін интерфейстерді теңшеу икемділігі",
        "Бірнеше аударма нұсқаларын қолдауға уақыт үнемдеу",
        "Локалдерді жаңарту кезінде қателер ықтималдығын төмендету",
        "Жаңа теңшеу аудармаларын қосу процесін жеңілдету",
        "Барлық баңылдар үшін бірегей codebase сақтау",
        "Теңшеу нұсқаларын жылдам орнату"
      ]
    }
  },
  "seatMap": {
    "title": "Ұшақ орындары картасын көрсетудің әмбебап жүйесі",
    "subtitle": "Әр түрлі дерек форматтары үшін драйверлері бар архитектура",
    "description": "Іске асырылған жүйе арнайы драйверлерді қолдана отырып, деректерді түрлендіру арқылы әр түрлі брондау жүйелерінен ұшақ орындары картасын бірегей әмбебап компонент арқылы көрсетуге мүмкіндік береді.",
    "features": {
      "title": "Негізгі мүмкіндіктер",
      "items": [
        "Әр түрлі жүйелердің көптеген дерек форматтарын қолдау",
        "Орындар картасын көрсетудің әмбебап компоненті",
        "Деректерді түрлендіру үшін драйверлер жүйесі",
        "Жаңа тұтынушыларға икемді баптау",
        "Көрсету бизнес-логикасының оқшауланғандығы",
        "Жаңа дерек көздерін тез қосу"
      ]
    },
    "architecture": {
      "title": "Архитектуралық компоненттер",
      "items": [
        {
          "name": "Universal Seat Map Component",
          "description": "бірегей API-сы бар орындар картасын көрсетудің негізгі компоненті"
        },
        {
          "name": "Data Drivers",
          "description": "әр түрлі форматтардан деректерді түрлендіру үшін арнайы драйверлер"
        },
        {
          "name": "Seat Map Engine",
          "description": "Көрсету үшін деректерді өңдеу және дайындау қозғалтқышы"
        },
        {
          "name": "Configuration Manager",
          "description": "драйверлерді компонентке қосу үшін конфигурация менеджері"
        }
      ]
    },
    "process": {
      "title": "Жұмыс процесі",
      "steps": [
        {
          "title": "Деректерді алу",
          "description": "Жүйе ұшақ орындары картасы бойынша деректерді сыртқы жүйеден нақты форматта алады"
        },
        {
          "title": "Драйверді таңдау",
          "description": "Деректер түріне немесе тұтынушыға байланысты сәйкес түрлендіру драйвері таңдалады"
        },
        {
          "title": "Деректерді түрлендіру",
          "description": "Драйвер кіріс деректерін компонент үшін бірыңғай форматқа түрлендіреді"
        },
        {
          "title": "Картаны сызу",
          "description": "Әмбебап компонент дайындалған деректерге негізделген орындар картасын көрсетеді"
        }
      ]
    },
    "benefits": {
      "title": "Көзқарастың артықшылықтары",
      "items": [
        "Өз дерек форматтары бар жаңа тұтынушыларды тез қосу",
        "Көрсету компонентінде кодтың қайталануының болмауы",
        "Жүйені қолдау мен жаңартуды жеңілдету",
        "Бизнес-логиканы деректер ерекшеліктерінен оқшаулау",
        "Архитектураның масштабталуы",
        "Жаңа интеграцияларды әзірлеу уақытын қысқарту"
      ]
    }
  },
  "multisync": {
    "title": "Таратылған Vue.js қолданбалары үшін бірегей синхрондау жүйесі",
    "subtitle": "Тәуелсіз қолданбалар арасында жай-күйді синхрондау архитектурасы қосымша шифрлау мүмкіндігімен",
    "description": "Бірегей репозиторий шеңберінде бірнеше тәуелсіз Vue-қолданбаларды жасау және басқару жүйесі, олар арасында жай-күйді автоматты синхрондаумен. Қосымша шифрлау және икемді конфигурациясы бар бірегей қойма арқылы қолданбалар арасындағы кросс-таб синхрондауы мен коммуникация механизмін жүзеге асырады.",
    "features": {
      "title": "Жүйенің негізгі мүмкіндіктері",
      "items": [
        "Бірегей репозиторийде бірнеше тәуелсіз Vue-қолданбалар үшін бірегей архитектура",
        "localStorage арқылы қолданбалар арасында автоматты кросс-таб синхрондау және жай-күй келісімі",
        "Жауапкершілікті бөлуі бар көп деңгейлі қоймалар жүйесі (Pinia + арнайы қоймалар)",
        "AES-GCM қолдана отырып, қойма деректерін қосымша шифрлау",
        "Циклдік жаңартулар мен деректер жарыстарын болдырмау механизмі",
        "Синхрондауды икемді басқару (жүріп жатқанда қосу/өшіру)",
        "Синхрондаудың барлық кезеңдерін егжей-тегжейлі журналдау және жөндеу"
      ]
    },
    "architecture": {
      "title": "Архитектуралық компоненттер",
      "items": [
        {
          "name": "Multi-App Coordinator",
          "description": "бірегей репозиторий шеңберінде бірнеше тәуелсіз Vue-қолданбаларды басқаратын орталық координатор"
        },
        {
          "name": "Cross-Tab Sync Engine",
          "description": "localStorage және арнайы оқиғалар арқылы браузер қойындылары арасында жай-күйді синхрондау қозғалтқышы"
        },
        {
          "name": "Layered Store Architecture",
          "description": "компоненттер арасында жауапкершілікті нақты бөлуі бар көп деңгейлі қоймалар архитектурасы"
        },
        {
          "name": "Optional Encryption Layer",
          "description": "AES-GCM қолдауы және кілттерді икемді конфигурациясы бар қосымша шифрлау қабаты"
        },
        {
          "name": "Cycle Prevention Mechanism",
          "description": "синхрондау кезінде циклдік жаңартулар мен деректер жарыстарын болдырмау механизмі"
        },
        {
          "name": "Unified Logging System",
          "description": "синхрондау және қате өңдеудің барлық операцияларын егжей-тегжейлейтін бірегей журналдау жүйесі"
        }
      ]
    },
    "process": {
      "title": "Жүйенің жұмыс процесі",
      "steps": [
        {
          "title": "Қолданбаларды іске қосу",
          "description": "Бірнеше тәуелсіз Vue-қолданбаларды жүктеу және іске қосу, бірегей синхрондалған қоймаға қосу"
        },
        {
          "title": "Синхрондауды конфигурациялау",
          "description": "Синхрондау параметрлерін, шифрлауды баптау және кросс-таб жаңартулары үшін тыңдаушыларды қосу"
        },
        {
          "title": "Таратылған жай-күйді басқару",
          "description": "Қолданбалар арасында өзгерістерді автоматты синхрондау, жаңартулар қайшылықтарын өңдеу және шешу"
        },
        {
          "title": "Деректерді қауіпсіз сақтау",
          "description": "Қойма деректерін қосымша шифрлау және жүйе жай-күйіне рұқсатсыз қол жеткізуден қорғау"
        },
        {
          "title": "Мониторинг және жөндеу",
          "description": "Қосылу статусы мен жаңартуларды визуализациялауы бар синхрондаудың барлық операцияларын егжей-тегжейлі журналдау"
        }
      ]
    },
    "benefits": {
      "title": "Көзқарастың артықшылықтары",
      "items": [
        "Бірнеше қолданбалар үшін бірегей codebase — кодтың қайталануын 60% қысқарту",
        "Автоматты синхрондау — қолданбалар арасында деректердің сәйкестілігін қамтамасыз ету",
        "Архитектура икемділігі — жүйеге жаңа қолданбаларды оңай қосу мүмкіндігі",
        "Қауіпсіздікті арттыру — пайдаланушының сыни деректерін қосымша шифрлау",
        "UX жақсару — кез келген қолданбадағы жай-күй өзгергенде интерфейстерді лезде жаңарту",
        "Масштабталу — синхрондалған жүйеде шектеусіз қолданбалар санын қолдау",
        "Жөндеуді жеңілдету — нақты уақыт режимінде синхрондаудың барлық операцияларын орталықтандырылған журналдау"
      ]
    },
    "metrics": {
      "title": "Негізгі метрикалар мен жетістіктер",
      "items": [
        "Бір жүйеде 3+ тәуелсіз Vue-қолданбаны қолдау",
        "Жаңа қолданбаларды әзірлеу уақытын 40% қысқарту",
        "100+ бір мезгілде жаңарту кезінде деректерді синхрондауды қамтамасыз ету",
        "Қолданбалар арасында кодтың қайталануын 70% азайту",
        "Қолданбааралық өзара әрекеттесті жөндеу уақытын 50% қысқарту"
      ]
    }
  },
  "remote_workplace": {
    "title": "Қашықтан жұмыс орны",
    "subtitle": "Кез келген жерден тиімді жұмыс істеуге дайын",
    "description": "Өнімді қашықтан жұмыс істеу үшін толық жабдықталған кеңістік. Командамен ыңғайлы әзірлеу және коммуникация үшін барлық қажеттілік.",
    "benefits_title": "Команда үшін артықшылықтар",
    "features": {
      "items": [
        {
          "icon": "workstation",
          "title": "Өнімді жұмыс станциясы",
          "description": "Заманауи IDE-мен жұмыс істеу және бір мезгілде бірнеше әзірлеу ортасын іске қосу үшін күшті компьютер"
        },
        {
          "icon": "monitors",
          "title": "Үш монитор",
          "description": "Кодты, браузерді және коммуникациялық қолданбаларды ыңғайлы бөлу үшін үлкен мониторлар"
        },
        {
          "icon": "internet",
          "title": "Тұрақты интернет",
          "description": "Бейнеконференциялар және кодты жылдам синхрондау үшін жоғары жылдамдықты сымды байланыс"
        },
        {
          "icon": "webcam",
          "title": "Веб-камера және гарнитура",
          "description": "Командамен күнделікті кеңестер үшін сапалы камера және гарнитура"
        }
      ]
    },
    "benefits": {
      "items": [
        "Тапсырмалар арасында лезде ауысу",
        "Кодпен және коммуникациямен параллель жұмыс",
        "Команда хабарламаларына жедел жауап беру",
        "Жоспарлауға және код-ревьюға сапалы қатысу",
        "Жиі бейнекездесулерге дайындық",
        "Коммуникацияға кететін уақытты азайту"
      ]
    }
  },
  "uiComponents": {
    "title": "UI компоненттерін әзірлеу",
    "subtitle": "UI компоненттері архитекторы",
    "description": "Қолжетімділікке, өнімділікке және әзірлеу ыңғайлылығына баса назар аудара отырып, ірі веб-қолданба үшін UI компоненттер кітапханасын жобаладым және іске асырдым.",
    "features": {
      "title": "Негізгі компоненттер",
      "items": [
        "Енгізу өрістері және селекторлар - Толық өзара әрекеттесу циклі бар компоненттер: тексеру, енгізу маскалары, арнайы плейсхолдерлер, қате және жүктелу күйлері",
        "Ақылды автокомплит - Пернетақтамен жұмыстың күрделі логикасы, виртуалды скроллинг, мобильді құрылғыларға бейімделу және T9-енгізуді қолдау",
        "Модальды терезелер мен тултиптер - Свайп-ишараларды қолдауы, скроллды бұғаттауы және фокус басқаруы бар оверлейлер үшін әмбебап компоненттер",
        "Күнтізбе және күндерді таңдау - Диапазондарды таңдаудың арнайы логикасы және визуалды күйлері бар күндер мен кезеңдерді таңдау үшін икемді компонент",
        "Кестелер мен қойындылар - Виртуализациясы бар өнімді кестелер және навигация үшін бағдарламалық API-сы бар бейімді қойындылар"
      ]
    },
    "architecture": {
      "title": "Архитектуралық компоненттер",
      "items": [
        {
          "name": "Негізгі компоненттер",
          "description": "ойластырылған API және темаландыру қолдауы бар негізгі UI элементтері"
        },
        {
          "name": "Композитті компоненттер",
          "description": "негізгі элементтерге негізделген күрделі құрама компоненттер"
        },
        {
          "name": "Темалар жүйесі",
          "description": "CSS Custom Properties арқылы сыртқы түрін теңшеу механизмі"
        },
        {
          "name": "Құжаттама",
          "description": "пайдалану мысалдары және API reference бар толық құжаттама"
        }
      ]
    },
    "process": {
      "title": "Әзірлеу процесі",
      "steps": [
        {
          "title": "API жобалау",
          "description": "Пайдалану ыңғайлылығын және тип қауіпсіздігін ескере отырып, компоненттер интерфейстерін әзірлеу"
        },
        {
          "title": "Негізгі функционалдылықты іске асыру",
          "description": "Қолжетімділік қолдауы бар компоненттердің негізгі функционалдылығын жасау"
        },
        {
          "title": "Тестілеу және құжаттау",
          "description": "Тесттер жазу және пайдалану мысалдары бар құжаттама жасау"
        },
        {
          "title": "Интеграция және кері байланыс",
          "description": "Жобаға енгізу және компоненттерді жақсарту үшін кері байланыс жинау"
        }
      ]
    },
    "benefits": {
      "title": "Көзқарастың артықшылықтары",
      "items": [
        "Компоненттерді қайта пайдалану арқылы фичаларды әзірлеу жылдамдығын 30% арттыру",
        "Қолданба бойынша интерфейстің біртектілігін қамтамасыз ету",
        "Код базасын қолдау мен масштабтауды жеңілдету",
        "Мобильді құрылғыларда пайдаланушы тәжірибесін жақсарту",
        "UI-логикасындағы багтар санын 40% азайту"
      ]
    }
  },
  "demonstration": {
    "title": "Кәсіби этика және менің дағдыларым",
    "description": "TravelShop сияқты коммерциялық жобалар шеңберінде код базасы компаниялардың зияткерлік меншігі болып табылады, сондықтан мен оны көрсетуге құқығым жоқ.",
    "readiness": "Тапсырмаларды шешуге деген көзқарасымды, код сапасын және кәсіби дағдыларымды іс жүзінде көрсету үшін сынақ тапсырмасын орындауға дайынмын."
  },
  "contacts": {
    "title": "Байланыс",
    "subtitle": "Маған ыңғайлы тәсілмен хабарласыңыз",
    "emails": {
      "label": "E-mail",
      "values": ["macrulezru@gmail.com", "macrulezru@yandex.ru"]
    },
    "telegram": {
      "label": "Telegram",
      "value": "Danil_Anapa"
    },
    "phone": {
      "label": "Телефон",
      "value": "+7 963 697-26-62"
    },
    "ya-messenger": {
      "label": "Яндекс Мессенджер",
      "value": "macrulezru"
    }
  },
  "form": {
    "title": "Кері байланыс формасы",
    "description": "Төмендегі форма арқылы маған тікелей жазыңыз",
    "default_subject": "Портфолио сайтынан хабарлама",
    "fields": {
      "name": "Аты",
      "email": "Email",
      "subject": "Тақырып",
      "message": "Хабарлама"
    },
    "placeholders": {
      "name": "Атыңызды енгізіңіз",
      "email": "Email-еңізді енгізіңіз",
      "subject": "Хабарлама тақырыбы (міндетті емес)",
      "message": "Жобаңыз туралы айтыңыз немесе сұрақ қойыңыз"
    },
    "submit": "Жіберу",
    "sending": "Жіберілуде...",
    "reset": "Тазарту",
    "sent_from": "Жіберілді бетінен",
    "success_message": "✅ Рахмет! Хабарлама жіберілді. 24 сағат ішінде жауап беремін.",
    "errors": {
      "name_required": "Атыңызды енгізіңіз",
      "email_required": "Email-еңізді енгізіңіз",
      "email_invalid": "Дұрыс email енгізіңіз",
      "message_required": "Хабарлама енгізіңіз",
      "submission_failed": "Жіберу кезінде қате орын алды. Хат пошта клиентінде ашылады."
    }
  },
  "location": "Жұмыс орны"
}
