{
  "navigation": {
    "home": "Главная",
    "about": "Обо мне",
    "experience": "Опыт",
    "travelshop": "TravelShop",
    "features": "Решения",
    "workplace": "Рабочее место",
    "contacts": "Контакты"
  },
  "splash": {
    "welcome": "Данил Лисин",
    "subtitle": "Vue.js Developer",
    "description": "Превращаю сложные задачи в элегантные решения. Специализируюсь на Vue 3, TypeScript и создании масштабируемых приложений с продуманной архитектурой.",
    "more": "изучить резюме"
  },
  "app": {
    "examples_title": "Примеры некоторых решений"
  },
  "about": {
    "intro": "Фронтенд-разработчик с опытом работы во Vue.js более 6 лет.",
    "approach": "Мой путь в веб-разработке и дизайне начался более 20 лет назад, что позволило мне сформировать комплексный подход к созданию интерфейсов. Я стремлюсь к тому, чтобы приложения были не только функциональными и производительными, но также имели продуманную логику взаимодействия и аккуратный визуал.",
    "bitrix_title": "Опыт работы с Bitrix",
    "bitrix_description": "Занимался поддержкой и разработкой новых шаблонов TravelShop 1.0 для разных авиакомпаний. Уверенно владею для этого языком PHP. Понимаю специфику Bitrix.",
    "bitrix_skills": [
      "Разработка и поддержка шаблонов TravelShop 1.0",
      "Интеграция с системами бронирования авиабилетов",
      "Кастомизация функциональности под требования авиакомпаний",
      "Работа с PHP в контексте Bitrix-проектов",
      "Понимание архитектуры и особенностей Bitrix"
    ],
    "skills_title": "В работе уделяю внимание архитектурной чистоте, поддерживаемости кода и типобезопасности. Имею опыт полного цикла разработки фронтенд-частей сложных SPA:",
    "skills_list": [
      {
        "title": "Проектирование структуры приложения",
        "description": "Разработка модульной и масштабируемой архитектуры, организация кодовой базы для удобства поддержки и развития"
      },
      {
        "title": "Верстка интерфейсов",
        "description": "Создание адаптивных, кроссбраузерных и доступных интерфейсов с использованием современных подходов (Flexbox, Grid)"
      },
      {
        "title": "Реализация управления состоянием",
        "description": "Настройка централизованного хранилища (Pinia/Vuex), организация данных и их реактивных связей между компонентами"
      },
      {
        "title": "Клиент-серверное взаимодействие",
        "description": "Построение сервис-слоя для работы с API, обработка ошибок, реализация механизмов повторных запросов и кеширования"
      },
      {
        "title": "Маршрутизация",
        "description": "Разработка сложных систем навигации с вложенными и защищенными маршрутами, ленивой загрузкой компонентов"
      }
    ],
    "conclusion": "Такой подход позволяет создавать надежные и масштабируемые решения, которые удобно развивать и сопровождать.",
    "tech_title": "Технологии и инструменты",
    "tech_stack_title": "Технический стек",
    "main_tech_title": "Основные технологии",
    "main_tech_list": [
      {
        "title": "Vue.js 3",
        "description": "Разработка SPA-приложений с использованием Composition API, composables, реактивность, работа с lifecycle hooks..."
      },
      {
        "title": "TypeScript",
        "description": "Строгая типизация, generics, utility types, типобезопасность в компонентах и сторах"
      },
      {
        "title": "Pinia",
        "description": "Управление состоянием приложения, организация модульных хранилищ, работа с actions/getters, TypeScript-интеграция"
      },
      {
        "title": "Vite",
        "description": "Быстрая сборка проектов, конфигурация плагинов, оптимизация production-сборки"
      }
    ],
    "infra_tech_title": "Инфраструктура и инструменты",
    "infra_tech_list": [
      {
        "title": "Vue Router",
        "description": "Навигация с lazy loading, nested routes, навигационные хуки, история переходов"
      },
      {
        "title": "Vue i18n",
        "description": "Локализация приложений, динамическая подгрузка переводов, pluralization"
      },
      {
        "title": "Git",
        "description": "Работа в команде, feature branches, code review, разрешение конфликтов"
      },
      {
        "title": "REST API",
        "description": "Разработка и использование кастомных обёрток для HTTP-запросов, обработка ошибок, кеширование, управление жизненным циклом запросов"
      }
    ],
    "layout_tech_title": "Верстка и стилизация",
    "layout_tech_list": [
      {
        "title": "HTML5/CSS3",
        "description": "Семантическая верстка, адаптивный дизайн, CSS Grid/Flexbox"
      },
      {
        "title": "SCSS/SASS",
        "description": "Препроцессинг, миксины, модульность стилей, кастомные свойства (CSS Custom Properties)"
      }
    ]
  },
  "tech": {
    "javascript": "Основа всего. Пишу современный ES6+ код",
    "vue": "Моя основная специализация. Vue 3, Composition API",
    "typescript": "Строгая типизация для надежности кода",
    "pinia": "Управление состоянием приложения",
    "vite": "Современная сборка для быстрой разработки",
    "i18n": "Локализация и мультиязычные интерфейсы",
    "html": "Семантическая и доступная верстка",
    "css": "Адаптивный дизайн, Flexbox, Grid",
    "php": "Разработка PHP-шаблонов в экосистеме Bitrix",
    "bitrix": "Поддержка шаблонов TravelShop для авиакомпаний",
    "git": "Распределённый контроль версий для всех проектов",
    "svn": "Опыт работы с централизованными системами контроля версий",
    "figma": "Работа с макетами Figma, вёрстка и правки"
  },
  "experience": {
    "title": "Опыт работы",
    "showAllButton": "Все компании",
    "items": [
      {
        "company": "Online Reservation System",
        "duration": "4 года и 11 месяцев",
        "position": "Ведущий HTML верстальщик / Фронтенд-разработчик",
        "period": "Декабрь 2020 — Октябрь 2025",
        "description": "Проектирование и разработка компонентов на Vue 3 для продуктов компании TWx, TravelShop. Создание архитектуры пользовательских интерфейсов, разработка интерактивных элементов и сложных SPA-приложений для системы бронирования авиабилетов. Поддержка и кастомизация шаблонов TravelShop под управлением Bitrix для различных авиакомпаний."
      },
      {
        "company": "Таис",
        "duration": "3 года и 3 месяца",
        "position": "Web-разработчик",
        "period": "Октябрь 2017 — Декабрь 2020",
        "description": "Разработка front-end интерфейсов для систем онлайн-бронирования и регистрации авиаперелётов. Создание интуитивно понятных пользовательских интерфейсов, работа с формами и валидацией данных, интеграция с бэкенд-системами и API."
      },
      {
        "company": "ТНТ, Телекомпания",
        "position": "Веб-дизайнер",
        "description": "Создание анимационных и интерактивных рекламных баннеров для телевизионных проектов. Полный цикл разработки: от концепции и дизайна до реализации с использованием HTML5, CSS3 и JavaScript. Создание адаптивных баннеров с поддержкой различных размеров и устройств."
      },
      {
        "company": "Баусервис, ООО",
        "position": "Веб-дизайнер",
        "description": "Разработка дизайна корпоративных сайтов, создание рекламных баннеров и иконографии. Полный цикл проектирования интерфейсов: от прототипирования и визуального дизайна до адаптивной верстки. Оптимизация графики и обеспечение кроссбраузерной совместимости."
      },
      {
        "company": "Европейская медиагруппа (ЕМГ)",
        "position": "Веб-дизайнер / Веб-разработчик",
        "description": "Разработка и поддержка веб-сайтов для медийных проектов компании. Создание пользовательских интерфейсов, дизайн промо-страниц и лендингов. Интеграция дизайна с системами управления контентом, оптимизация производительности веб-страниц."
      },
      {
        "company": "Advego",
        "position": "Веб-дизайнер / Веб-разработчик",
        "description": "Полный цикл создания веб-проектов: от проектирования пользовательских интерфейсов и дизайна до frontend-разработки. Создание интуитивных интерфейсов для биржи контента, разработка административных панелей и кабинетов пользователей. Оптимизация пользовательского опыта и взаимодействия."
      },
      {
        "company": "NIKITA ONLINE",
        "position": "Веб-дизайнер",
        "description": "Разработка дизайна корпоративных сайтов и промо-страниц для игровых проектов компании. Создание визуальных концепций, разработка макетов страниц и элементов интерфейса. Подготовка графических материалов для веб-публикаций."
      },
      {
        "company": "Nettrader",
        "position": "Веб-дизайнер",
        "description": "Дизайн пользовательских интерфейсов для финансовых и торговых платформ. Создание интуитивных и функциональных интерфейсов для работы с финансовыми данными. Разработка системы визуальной коммуникации и элементов брендинга."
      },
      {
        "company": "Коммуникационное агентство SOLDIS",
        "position": "Веб-дизайнер",
        "description": "Создание дизайна сайтов для клиентов агентства. Разработка визуальных концепций, подготовка макетов и графических элементов. Работа над улучшением пользовательского опыта и навигации на веб-ресурсах."
      },
      {
        "company": "Ютинет.Ру",
        "position": "Веб-дизайнер",
        "description": "Дизайн и разработка веб-интерфейсов для интернет-портала. Создание пользовательских интерфейсов, работа над улучшением навигации и структуры контента. Разработка графических элементов и системы визуальной идентификации."
      },
      {
        "company": "Цифровой центр ИОН",
        "position": "Веб-дизайнер",
        "description": "Проектирование и дизайн веб-сайтов для различных бизнес-сегментов. Полный цикл создания интерфейсов: от исследования целевой аудитории и создания прототипов до финальной реализации. Разработка адаптивных дизайнов и обеспечение кроссбраузерной совместимости."
      },
      {
        "company": "ADT Web Solutions",
        "position": "Веб-дизайнер",
        "description": "Создание дизайна корпоративных сайтов и интернет-магазинов. Разработка пользовательских интерфейсов, проектирование навигации и структуры контента. Работа над брендингом и создание единой визуальной системы для веб-проектов."
      },
      {
        "company": "Фриланс",
        "position": "Веб-дизайнер",
        "description": "Выполнение заказов по дизайну и разработке веб-сайтов для различных клиентов. Создание уникальных дизайн-концепций, разработка макетов страниц, подготовка графических элементов. Работа над полным циклом создания веб-проектов от идеи до реализации."
      },
      {
        "company": "Артез продакшен",
        "position": "WEB дизайнер",
        "description": "Дизайн веб-сайтов для клиентов производственной компании. Создание визуальных концепций, разработка интерфейсов и навигационных систем. Подготовка графики для веб-публикаций и обеспечение соответствия дизайна техническим требованиям."
      },
      {
        "company": "Publicis United",
        "position": "WEB дизайнер",
        "description": "Дизайн и разработка веб-сайтов для крупных клиентов рекламного агентства. Создание интерактивных интерфейсов, работа над улучшением пользовательского опыта. Участие в создании комплексных цифровых решений для брендов. Работа в соответствии с корпоративными стандартами и гайдлайнами клиентов."
      },
      {
        "company": "AVM New Wave Inc.",
        "position": "WEB дизайнер",
        "description": "Дизайн первых веб-сайтов в начале развития интернета в России. Создание основополагающих принципов веб-дизайна и навигации. Работа с ограниченными техническими возможностями того времени, оптимизация графики для медленных интернет-соединений."
      }
    ]
  },
  "travelshop": {
    "title": "TravelShop - Система бронирования авиабилетов",
    "role": "Ведущий Frontend-разработчик",
    "period": "Декабрь 2020 — Октябрь 2025",
    "description": "Разработка и поддержка современной системы бронирования авиабилетов для российских и зарубежных авиакомпаний, включая «Азимут»",
    "features": {
      "title": "Ключевые функции системы",
      "items": [
        "Поиск и бронирование авиабилетов в реальном времени",
        "Сложная бизнес-логика расчета тарифов и сборов",
        "Многошаговый процесс бронирования с валидацией данных",
        "Система управления заказами и пассажирами",
        "Интеграция с системами бронирования (GDS)",
        "Поддержка дополнительных услуг (багаж, питание, страховки)",
        "Адаптивный дизайн для всех устройств"
      ]
    },
    "tech_stack": {
      "title": "Технический стек",
      "items": [
        "Vue 3 с Composition API и TypeScript",
        "Собственная библиотека UI-компонентов",
        "Vite для быстрой сборки и разработки",
        "Pinia для управления состоянием приложения",
        "Vue Router с ленивой загрузкой компонентов",
        "REST API с централизованной обработкой ошибок",
        "Интернационализация (i18n)"
      ]
    },
    "achievements": {
      "title": "Достижения и результаты",
      "items": [
        "Разработал масштабируемую архитектуру компонентов, позволившую ускорить разработку новых функций на 40%",
        "Создал систему валидации форм, сократившую количество ошибок при бронировании на 60%",
        "Реализовал механизм кеширования поисковых запросов, улучшивший производительность на 25%",
        "Настроил процесс code review и внедрил статическую типизацию, повысив надежность кода",
        "Разработал адаптивный дизайн, обеспечивающий корректную работу на всех типах устройств"
      ]
    },
    "projects": {
      "title": "Реализованные проекты",
      "items": [
        {
          "name": "Авиакомпания «Азимут»",
          "url": "https://booking.azimuth.ru/new/",
          "description": "Полнофункциональная система бронирования с кастомизированным дизайном"
        },
        {
          "name": "TravelShop White Label",
          "url": "https://ors-aero.ru/travelshop",
          "description": "Базовая платформа для быстрого разворачивания систем бронирования"
        }
      ]
    },
    "view_screenshots": "Посмотреть скриншоты TravelShop",
    "loading_screenshots": "Загрузка скриншотов...",
    "images": {
      "description": {
        "desktop_1": "Форма поиска рейсов",
        "desktop_2": "Экран выдачи найденных рейсов",
        "desktop_3": "Выбор тарифа",
        "desktop_4": "Экран с формой данных пассажиров",
        "desktop_5": "Выбор услуг на рейс",
        "desktop_6": "Выбор места в салоне самолёта",
        "desktop_7": "Экран прекоммита",
        "desktop_8": "Корзина с выбранными услугами",
        "default": "Изображение {number}"
      }
    }
  },
  "common": {
    "loading": "Загрузка...",
    "loading_images": "Загрузка изображений...",
    "loading_please_wait": "Пожалуйста, подождите...",
    "previous_image": "Предыдущее изображение",
    "next_image": "Следующее изображение",
    "close": "Закрыть",
    "thumbnail": "Миниатюра {number}"
  },
  "pipeline": {
    "title": "Конвейерная система REST API запросов",
    "subtitle": "Эффективное управление цепочками взаимосвязанных API-вызовов",
    "description": "Мощная система для организации последовательных HTTP-запросов к REST API, где каждый последующий вызов может использовать данные предыдущего. Обеспечивает полный контроль над выполнением цепочек запросов с визуализацией прогресса и интеллектуальной обработкой ошибок.",
    "features": {
      "title": "Ключевые возможности системы",
      "items": [
        "Последовательное выполнение цепочек взаимосвязанных HTTP-запросов",
        "Автоматическая передача данных между этапами конвейера",
        "Детальное отслеживание прогресса выполнения в реальном времени",
        "Интеллектуальная обработка HTTP-ошибок с механизмом повторов",
        "Условная логика выполнения запросов на основе предыдущих результатов",
        "Автоматическая отмена зависимых запросов при критических ошибках",
        "Полная типобезопасность на всех этапах выполнения"
      ]
    },
    "architecture": {
      "title": "Архитектурные компоненты",
      "items": [
        {
          "name": "Pipeline Orchestrator",
          "description": "центральный координатор, управляющий последовательностью выполнения API-запросов и передачей данных между ними"
        },
        {
          "name": "Request Executor",
          "description": "исполнитель HTTP-запросов с поддержкой retry-логики, таймаутов и обработки различных статус-кодов"
        },
        {
          "name": "Progress Tracker",
          "description": "модуль отслеживания прогресса выполнения цепочки запросов с детализацией по каждому этапу"
        },
        {
          "name": "Error Handler",
          "description": "централизованный обработчик ошибок с классификацией по типам и стратегиями восстановления"
        },
        {
          "name": "Type Safety Layer",
          "description": "слой строгой типизации, обеспечивающий корректность данных на всех этапах конвейера"
        }
      ]
    },
    "process": {
      "title": "Процесс работы конвейера",
      "steps": [
        {
          "title": "Конфигурация цепочки запросов",
          "description": "Определение последовательности API-вызовов, зависимостей между ними и условий выполнения каждого этапа"
        },
        {
          "title": "Инициализация и валидация",
          "description": "Проверка корректности конфигурации, подготовка данных и инициализация отслеживания прогресса выполнения"
        },
        {
          "title": "Последовательное выполнение",
          "description": "Поэтапное выполнение HTTP-запросов с автоматической передачей данных и обработкой промежуточных результатов"
        },
        {
          "title": "Мониторинг и управление",
          "description": "Непрерывное отслеживание прогресса, обработка возникающих ошибок и адаптивное управление выполнением цепочки"
        },
        {
          "title": "Финальная обработка и очистка",
          "description": "Агрегация результатов всех запросов, финализация данных и освобождение ресурсов системы"
        }
      ]
    },
    "benefits": {
      "title": "Преимущества подхода",
      "items": [
        "Сокращение времени разработки сложных API-взаимодействий на 40%",
        "Повышение надежности за счет централизованной обработки ошибок и retry-механизмов",
        "Улучшение пользовательского опыта через точное отображение прогресса выполнения",
        "Упрощение отладки и мониторинга цепочек запросов",
        "Гибкость для реализации сложных бизнес-процессов с зависимыми API-вызовами",
        "Полная типобезопасность снижает количество runtime-ошибок",
        "Легкая интеграция с существующей Vue.js экосистемой приложения"
      ]
    }
  },
  "localization": {
    "title": "Гибкая система локализации с переопределением реплик",
    "subtitle": "Механизм кастомизации переводов для разных бандлов",
    "description": "Реализованная система позволяет переопределять конкретные реплики в локалях в зависимости от бандла сборки проекта, обеспечивая гибкость в кастомизации интерфейсов для разных клиентов.",
    "features": {
      "title": "Ключевые возможности",
      "items": [
        "Переопределение конкретных реплик без дублирования всего словаря",
        "Поддержка множества языков с кастомизацией для каждого",
        "Автоматическое слияние дефолтных и кастомных локалей",
        "Гибкая настройка под разные бандлы сборки",
        "Сохранение дефолтных значений для непереопределенных реплик",
        "Быстрое добавление новых кастомных переводов"
      ]
    },
    "architecture": {
      "title": "Архитектурные компоненты",
      "items": [
        {
          "name": "Base Locales",
          "description": "основные словари переводов со стандартными репликами для всех языков"
        },
        {
          "name": "Custom Locales",
          "description": "кастомные словари с переопределенными репликами для конкретных бандлов"
        },
        {
          "name": "Merge Engine",
          "description": "механизм слияния дефолтных и кастомных локалей во время сборки"
        },
        {
          "name": "Bundle Config",
          "description": "конфигурация бандлов с указанием кастомных словарей для переопределения"
        }
      ]
    },
    "process": {
      "title": "Процесс работы",
      "steps": [
        {
          "title": "Определение бандла",
          "description": "Система идентифицирует текущий бандл сборки и проверяет наличие кастомных словарей для него"
        },
        {
          "title": "Загрузка локалей",
          "description": "Загружаются базовые словари переводов и кастомные словари для указанного бандла"
        },
        {
          "title": "Слияние словарей",
          "description": "Дефолтные локали объединяются с кастомными, при этом кастомные реплики имеют приоритет"
        },
        {
          "title": "Генерация результата",
          "description": "Формируются финальные словари переводов, используемые в приложении"
        }
      ]
    },
    "benefits": {
      "title": "Преимущества подхода",
      "items": [
        "Гибкость кастомизации интерфейсов для разных клиентов",
        "Экономия времени на поддержке нескольких версий переводов",
        "Снижение вероятности ошибок при обновлении локалей",
        "Упрощение процесса добавления новых кастомных переводов",
        "Сохранение единой codebase для всех бандлов",
        "Быстрое развертывание кастомизированных версий"
      ]
    }
  },
  "seatMap": {
    "title": "Универсальная система отображения карты мест самолета",
    "subtitle": "Архитектура с драйверами для разных форматов данных",
    "description": "Реализованная система позволяет отображать карты мест самолета из различных систем бронирования через единый универсальный компонент, используя специальные драйверы для преобразования данных.",
    "features": {
      "title": "Ключевые возможности",
      "items": [
        "Поддержка множества форматов данных от разных систем",
        "Универсальный компонент отображения карты мест",
        "Система драйверов для преобразования данных",
        "Гибкая настройка под новых клиентов",
        "Изолированная бизнес-логика отображения",
        "Быстрое подключение новых источников данных"
      ]
    },
    "architecture": {
      "title": "Архитектурные компоненты",
      "items": [
        {
          "name": "Universal Seat Map Component",
          "description": "основной компонент отображения карты мест с единым API"
        },
        {
          "name": "Data Drivers",
          "description": "специализированные драйверы для преобразования данных из разных форматов"
        },
        {
          "name": "Seat Map Engine",
          "description": "движок обработки и подготовки данных для отображения"
        },
        {
          "name": "Configuration Manager",
          "description": "менеджер конфигурации для подключения драйверов к компоненту"
        }
      ]
    },
    "process": {
      "title": "Процесс работы",
      "steps": [
        {
          "title": "Получение данных",
          "description": "Система получает данные о карте мест из внешней системы в специфичном формате"
        },
        {
          "title": "Выбор драйвера",
          "description": "На основе типа данных или клиента выбирается соответствующий драйвер преобразования"
        },
        {
          "title": "Преобразование данных",
          "description": "Драйвер преобразует входящие данные в унифицированный формат для компонента"
        },
        {
          "title": "Отрисовка карты",
          "description": "Универсальный компонент отображает карту мест на основе подготовленных данных"
        }
      ]
    },
    "benefits": {
      "title": "Преимущества подхода",
      "items": [
        "Быстрое подключение новых клиентов со своими форматами данных",
        "Отсутствие дублирования кода в компоненте отображения",
        "Упрощение поддержки и обновлений системы",
        "Изоляция бизнес-логики от специфики данных",
        "Масштабируемость архитектуры",
        "Снижение времени разработки для новых интеграций"
      ]
    }
  },
  "multisync": {
    "title": "Единая система синхронизации для распределенных Vue.js приложений",
    "subtitle": "Архитектура синхронизации состояний между независимыми приложениями с опциональным шифрованием",
    "description": "Система для создания и управления несколькими независимыми Vue-приложениями в рамках единого репозитория с автоматической синхронизацией состояний между ними. Реализует механизм кросс-таб синхронизации и коммуникации между приложениями через единое хранилище с поддержкой шифрования и гибкой конфигурацией.",
    "features": {
      "title": "Ключевые возможности системы",
      "items": [
        "Единая архитектура для нескольких независимых Vue-приложений в одном репозитории",
        "Автоматическая кросс-таб синхронизация и согласование состояний между приложениями через localStorage",
        "Многоуровневая система хранилищ с разделением ответственности (Pinia + кастомные сторес)",
        "Опциональное шифрование данных хранилища с использованием AES-GCM",
        "Механизм предотвращения цикличных обновлений и гонок данных",
        "Гибкое управление синхронизацией (включение/выключение на лету)",
        "Детальное логирование и отладка всех этапов синхронизации"
      ]
    },
    "architecture": {
      "title": "Архитектурные компоненты",
      "items": [
        {
          "name": "Multi-App Coordinator",
          "description": "центральный координатор, управляющий несколькими независимыми Vue-приложениями в рамках единого репозитория"
        },
        {
          "name": "Cross-Tab Sync Engine",
          "description": "движок синхронизации состояний между вкладками браузера через localStorage и кастомные события"
        },
        {
          "name": "Layered Store Architecture",
          "description": "многоуровневая архитектура хранилищ с четким разделением ответственности между компонентами"
        },
        {
          "name": "Optional Encryption Layer",
          "description": "опциональный слой шифрования данных с поддержкой AES-GCM и гибкой конфигурацией ключей"
        },
        {
          "name": "Cycle Prevention Mechanism",
          "description": "механизм предотвращения циклических обновлений и гонок данных при синхронизации"
        },
        {
          "name": "Unified Logging System",
          "description": "единая система логирования с детализацией всех операций синхронизации и обработки ошибок"
        }
      ]
    },
    "process": {
      "title": "Процесс работы системы",
      "steps": [
        {
          "title": "Инициализация приложений",
          "description": "Загрузка и инициализация нескольких независимых Vue-приложений с подключением к единому синхронизированному хранилищу"
        },
        {
          "title": "Конфигурация синхронизации",
          "description": "Настройка параметров синхронизации, шифрования и подключение слушателей событий для кросс-таб обновлений"
        },
        {
          "title": "Распределенное управление состоянием",
          "description": "Автоматическая синхронизация изменений между приложениями с обработкой и разрешением конфликтов обновлений"
        },
        {
          "title": "Безопасное хранение данных",
          "description": "Опциональное шифрование данных хранилища и защита от неавторизованного доступа к состоянию системы"
        },
        {
          "title": "Мониторинг и отладка",
          "description": "Детальное логирование всех операций синхронизации с визуализацией статуса подключения и обновлений"
        }
      ]
    },
    "benefits": {
      "title": "Преимущества подхода",
      "items": [
        "Единая codebase для нескольких приложений — сокращение дублирования кода на 60%",
        "Автоматическая синхронизация — обеспечение согласованности данных между приложениями",
        "Гибкость архитектуры — возможность легко добавлять новые приложения в систему",
        "Повышение безопасности — опциональное шифрование критических данных пользователя",
        "Улучшение UX — мгновенное обновление интерфейсов при изменении состояния в любом приложении",
        "Масштабируемость — поддержка неограниченного количества приложений в синхронизированной системе",
        "Упрощение отладки — централизованное логирование всех операций синхронизации в реальном времени"
      ]
    },
    "metrics": {
      "title": "Ключевые метрики и достижения",
      "items": [
        "Поддержка 3+ независимых Vue-приложений в одной системе",
        "Сокращение времени разработки новых приложений на 40%",
        "Обеспечение синхронизации данных при 100+ одновременных обновлениях",
        "Уменьшение дублирования кода между приложениями на 70%",
        "Снижение времени отладки межприложенных взаимодействий на 50%"
      ]
    }
  },
  "remote_workplace": {
    "title": "Удалённое рабочее место",
    "subtitle": "Готов к эффективной работе из любой точки",
    "description": "Полностью оборудованное пространство для продуктивной удалённой работы. Всё необходимое для комфортной разработки и коммуникации с командой.",
    "benefits_title": "Преимущества для команды",
    "features": {
      "items": [
        {
          "icon": "workstation",
          "title": "Производительная рабочая станция",
          "description": "Мощный компьютер для работы с современными IDE и одновременного запуска нескольких сред разработки"
        },
        {
          "icon": "monitors",
          "title": "Три монитора",
          "description": "Большие мониторы для комфортного разделения кода, браузера и коммуникационных приложений"
        },
        {
          "icon": "internet",
          "title": "Стабильный интернет",
          "description": "Высокоскоростное проводное соединение для видеоконференций и быстрой синхронизации кода"
        },
        {
          "icon": "webcam",
          "title": "Веб-камера и гарнитура",
          "description": "Качественная камера и гарнитура для ежедневных совещаний с командой"
        }
      ]
    },
    "benefits": {
      "items": [
        "Мгновенное переключение между задачами",
        "Параллельная работа над кодом и коммуникацией",
        "Оперативное реагирование на сообщения команды",
        "Качественное участие в планировании и код-ревью",
        "Готовность к частым видеовстречам",
        "Снижение времени на коммуникацию"
      ]
    }
  },
  "uiComponents": {
    "title": "Разработка UI компонентов",
    "subtitle": "Архитектор UI компонентов",
    "description": "Спроектировал и реализовал библиотеку UI компонентов для крупного веб-приложения с фокусом на доступность, производительность и удобство разработки.",
    "features": {
      "title": "Ключевые компоненты",
      "items": [
        "Поля ввода и селекторы - Компоненты с полным циклом взаимодействия: валидация, маски ввода, кастомные плейсхолдеры, состояния ошибки и загрузки",
        "Умный автокомплит - Сложная логика работы с клавиатурой, виртуальный скроллинг, адаптация под мобильные устройства и поддержка T9-ввода",
        "Модальные окна и тултипы - Универсальные компоненты для оверлеев с поддержкой свайп-жестов, блокировкой скролла и управлением фокусом",
        "Календарь и выбор дат - Гибкий компонент для выбора дат и периодов с кастомной логикой выделения диапазонов и визуальными состояниями",
        "Таблицы и вкладки - Производительные таблицы с виртуализацией и адаптивные вкладки с программным API для навигации"
      ]
    },
    "architecture": {
      "title": "Архитектурные компоненты",
      "items": [
        {
          "name": "Базовые компоненты",
          "description": "фундаментальные UI элементы с продуманной API и поддержкой теммизации"
        },
        {
          "name": "Композитные компоненты",
          "description": "сложные составные компоненты, построенные на основе базовых элементов"
        },
        {
          "name": "Система тем",
          "description": "механизм кастомизации внешнего вида через CSS Custom Properties"
        },
        {
          "name": "Документация",
          "description": "полная документация с примерами использования и API reference"
        }
      ]
    },
    "process": {
      "title": "Процесс разработки",
      "steps": [
        {
          "title": "Проектирование API",
          "description": "Разработка интерфейсов компонентов с учетом удобства использования и типобезопасности"
        },
        {
          "title": "Реализация базовой функциональности",
          "description": "Создание основного функционала компонентов с поддержкой accessibility"
        },
        {
          "title": "Тестирование и документирование",
          "description": "Написание тестов и создание документации с примерами использования"
        },
        {
          "title": "Интеграция и обратная связь",
          "description": "Внедрение в проект и сбор обратной связи для улучшения компонентов"
        }
      ]
    },
    "benefits": {
      "title": "Преимущества подхода",
      "items": [
        "Ускорение разработки фич на 30% за счет повторного использования компонентов",
        "Обеспечение единообразия интерфейса во всем приложении",
        "Упрощение поддержки и масштабирования кодовой базы",
        "Улучшение пользовательского опыта на мобильных устройствах",
        "Снижение количества багов в UI-логике на 40%"
      ]
    }
  },
  "demonstration": {
    "title": "Профессиональная этика и мои навыки",
    "description": "В рамках коммерческих проектов, таких как TravelShop, кодовая база является интеллектуальной собственностью компаний, поэтому я не имею права её демонстрировать.",
    "readiness": "Готов выполнить тестовое задание, чтобы на практике показать свой подход к решению задач, качество кода и профессиональные навыки."
  },
  "contacts": {
    "title": "Контакты",
    "subtitle": "Свяжитесь со мной удобным способом",
    "emails": {
      "label": "E-mail",
      "values": ["macrulezru@gmail.com", "macrulezru@yandex.ru"]
    },
    "telegram": {
      "label": "Telegram",
      "value": "Danil_Anapa"
    },
    "phone": {
      "label": "Телефон",
      "value": "+7 963 697-26-62"
    },
    "ya-messenger": {
      "label": "Яндекс Мессенджер",
      "value": "macrulezru"
    }
  },
  "form": {
    "title": "Форма обратной связи",
    "description": "Напишите мне напрямую через форму ниже",
    "default_subject": "Сообщение с сайта-портфолио",
    "fields": {
      "name": "Имя",
      "email": "Email",
      "subject": "Тема",
      "message": "Сообщение"
    },
    "placeholders": {
      "name": "Введите ваше имя",
      "email": "Введите ваш email",
      "subject": "Тема сообщения (необязательно)",
      "message": "Расскажите о вашем проекте или задайте вопрос"
    },
    "submit": "Отправить",
    "sending": "Отправка...",
    "reset": "Очистить",
    "sent_from": "Отправлено со страницы",
    "success_message": "✅ Спасибо! Сообщение отправлено. Отвечу в течение 24 часов.",
    "errors": {
      "name_required": "Пожалуйста, введите ваше имя",
      "email_required": "Пожалуйста, введите ваш email",
      "email_invalid": "Пожалуйста, введите корректный email",
      "message_required": "Пожалуйста, введите сообщение",
      "submission_failed": "Ошибка при отправке. Письмо будет открыто в вашем почтовом клиенте."
    }
  }
}
